tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Infineon/TLE983x_SFR.H
//****************************************************************************
// @Module        Project Settings
// @Filename      TLE9832_SFR.H
//----------------------------------------------------------------------------
// @Controller    Infineon TLE9832
//
// @Compiler      Keil
//
//
// @Description   This is the include header file for all other modules.
//
//----------------------------------------------------------------------------
// @Date          06.05.2009
//
//****************************************************************************



/* Macros definition for easy SFR access */
#define  SETB( sfr_reg, bit_mask )   ( sfr_reg |= bit_mask )
#define  CLRB( sfr_reg, bit_mask )   ( sfr_reg &= ~bit_mask )

/* sfr address definition in plain format */
/* ADC */
sfr   ADC_PAGE        =    	0xd1;  // RMAP=0, PAGE= x - ADC Page Register
sfr   ADC_GLOBCTR     =    	0xca;  // RMAP=0, PAGE= 0 - ADC Global Control Register
sfr   ADC_GLOBSTR     =    	0xcb;  // RMAP=0, PAGE= 0 - ADC Global Status Register
sfr   ADC_PRAR        =    	0xcc;  // RMAP=0, PAGE= 0 - ADC Priority and Arbitration Register
sfr   ADC_LCBR        =    	0xcd;  // RMAP=0, PAGE= 0 - ADC Limit Check Boundary Register
sfr   ADC_INPCR0      =    	0xce;  // RMAP=0, PAGE= 0 - ADC Input Class 0 Register
sfr   ADC_ETRCR       =    	0xcf;  // RMAP=0, PAGE= 0 - ADC External Trigger Control Register
sfr   ADC_CHCTR0      =    	0xca;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 0
sfr   ADC_CHCTR1      =    	0xcb;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 1
sfr   ADC_CHCTR2      =    	0xcc;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 2
sfr   ADC_CHCTR3      =    	0xcd;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 3
sfr   ADC_CHCTR4      =    	0xce;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 4
sfr   ADC_CHCTR5      =    	0xcf;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 5
sfr   ADC_CHCTR6      =    	0xd2;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 6
sfr   ADC_CHCTR7      =    	0xd3;  // RMAP=0, PAGE= 1 - ADC Channel Control Register 7
sfr   ADC_RESR0L      =    	0xca;  // RMAP=0, PAGE= 2 - ADC Result Register 0 Low
sfr   ADC_RESR0H      =    	0xcb;  // RMAP=0, PAGE= 2 - ADC Result Register 0 High
sfr   ADC_RESR1L      =    	0xcc;  // RMAP=0, PAGE= 2 - ADC Result Register 1 Low
sfr   ADC_RESR1H      =    	0xcd;  // RMAP=0, PAGE= 2 - ADC Result Register 1 High
sfr   ADC_RESR2L      =    	0xce;  // RMAP=0, PAGE= 2 - ADC Result Register 2 Low
sfr   ADC_RESR2H      =    	0xcf;  // RMAP=0, PAGE= 2 - ADC Result Register 2 High
sfr   ADC_RESR3L      =    	0xd2;  // RMAP=0, PAGE= 2 - ADC Result Register 3 Low
sfr   ADC_RESR3H      =    	0xd3;  // RMAP=0, PAGE= 2 - ADC Result Register 3 High
sfr   ADC_RESRA0L     =    	0xca;  // RMAP=0, PAGE= 3 - ADC Result Register 0, View A Low
sfr   ADC_RESRA0H     =    	0xcb;  // RMAP=0, PAGE= 3 - ADC Result Register 0, View A High
sfr   ADC_RESRA1L     =    	0xcc;  // RMAP=0, PAGE= 3 - ADC Result Register 1, View A Low
sfr   ADC_RESRA1H     =    	0xcd;  // RMAP=0, PAGE= 3 - ADC Result Register 1, View A High
sfr   ADC_RESRA2L     =    	0xce;  // RMAP=0, PAGE= 3 - ADC Result Register 2, View A Low
sfr   ADC_RESRA2H     =    	0xcf;  // RMAP=0, PAGE= 3 - ADC Result Register 2, View A High
sfr   ADC_RESRA3L     =    	0xd2;  // RMAP=0, PAGE= 3 - ADC Result Register 3, View A Low
sfr   ADC_RESRA3H     =    	0xd3;  // RMAP=0, PAGE= 3 - ADC Result Register 3, View A High
sfr   ADC_RCR0        =    	0xca;  // RMAP=0, PAGE= 4 - ADC Result Control Register 0
sfr   ADC_RCR1        =    	0xcb;  // RMAP=0, PAGE= 4 - ADC Result Control Register 1
sfr   ADC_RCR2        =    	0xcc;  // RMAP=0, PAGE= 4 - ADC Result Control Register 2
sfr   ADC_RCR3        =    	0xcd;  // RMAP=0, PAGE= 4 - ADC Result Control Register 3
sfr   ADC_VFCR        =    	0xce;  // RMAP=0, PAGE= 4 - ADC Valid Flag Clear Register
sfr   ADC_CHINFR      =    	0xca;  // RMAP=0, PAGE= 5 - ADC Channel Interrupt Flag Register
sfr   ADC_CHINCR      =    	0xcb;  // RMAP=0, PAGE= 5 - ADC Channel Interrupt Clear Register
sfr   ADC_CHINSR      =    	0xcc;  // RMAP=0, PAGE= 5 - ADC Channel Interrupt Set Register
sfr   ADC_CHINPR      =    	0xcd;  // RMAP=0, PAGE= 5 - ADC Channel Interrupt Node Pointer Register
sfr   ADC_EVINFR      =    	0xce;  // RMAP=0, PAGE= 5 - ADC Event Interrupt Flag Register
sfr   ADC_EVINCR      =    	0xcf;  // RMAP=0, PAGE= 5 - ADC Event Interrupt Clear Flag Register
sfr   ADC_EVINSR      =    	0xd2;  // RMAP=0, PAGE= 5 - ADC Event Interrupt Set Flag Register
sfr   ADC_EVINPR      =    	0xd3;  // RMAP=0, PAGE= 5 - ADC Event Interrupt Node Pointer Register
sfr   ADC_CRCR1       =    	0xca;  // RMAP=0, PAGE= 6 - ADC Conversion Request Control Register 1
sfr   ADC_CRPR1       =    	0xcb;  // RMAP=0, PAGE= 6 - ADC Conversion Request Pending Register 1
sfr   ADC_CRMR1       =    	0xcc;  // RMAP=0, PAGE= 6 - ADC Conversion Request Mode Register 1
sfr   ADC_QMR0        =    	0xcd;  // RMAP=0, PAGE= 6 - ADC Queue Mode Register 0
sfr   ADC_QSR0        =    	0xce;  // RMAP=0, PAGE= 6 - ADC Queue Status Register 0
sfr   ADC_Q0R0        =    	0xcf;  // RMAP=0, PAGE= 6 - ADC Queue 0 Register 0
sfr   ADC_QBUR0       =    	0xd2;  // RMAP=0, PAGE= 6 - ADC Queue Backup Register 0
sfr   ADC_QINR0       =    	0xd2;  // RMAP=0, PAGE= 6 - ADC Queue Input Register 0

/* CCU6 */
sfr   CCU6_PAGE       =   	0xa3;  // RMAP=0, PAGE= x - CCU6 Page Register
sfr   CCU6_CC63SRL    =    	0x9a;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC63 Low
sfr   CCU6_CC63SRH    =    	0x9b;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC63 High
sfr   CCU6_TCTR4L     =    	0x9c;  // RMAP=0, PAGE= 0 - CCU6 Timer Control Register 4 Low
sfr   CCU6_TCTR4H     =    	0x9d;  // RMAP=0, PAGE= 0 - CCU6 Timer Control Register 4 High
sfr   CCU6_MCMOUTSL   =    	0x9e;  // RMAP=0, PAGE= 0 - CCU6 Multi-Channel Mode Output Shadow Register Low
sfr   CCU6_MCMOUTSH   =    	0x9f;  // RMAP=0, PAGE= 0 - CCU6 Multi-Channel Mode Output Shadow Register High
sfr   CCU6_ISRL       =    	0xa4;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Interrupt Status Reset Register Low
sfr   CCU6_ISRH       =    	0xa5;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Interrupt Status Reset Register High
sfr   CCU6_CMPMODIFL  =    	0xa6;  // RMAP=0, PAGE= 0 - CCU6 Compare State Modification Register Low
sfr   CCU6_CMPMODIFH  =    	0xa7;  // RMAP=0, PAGE= 0 - CCU6 Compare State Modification Register High
sfr   CCU6_CC60SRL    =    	0xfa;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC60 Low
sfr   CCU6_CC60SRH    =    	0xfb;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC60 High
sfr   CCU6_CC61SRL    =    	0xfc;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC61 Low
sfr   CCU6_CC61SRH    =    	0xfd;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC61 High
sfr   CCU6_CC62SRL    =    	0xfe;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC62 Low
sfr   CCU6_CC62SRH    =    	0xff;  // RMAP=0, PAGE= 0 - CCU6 Capture/Compare Shadow Register for Channel CC62 High
sfr   CCU6_CC63RL     =    	0x9a;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC63 Low
sfr   CCU6_CC63RH     =    	0x9b;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC63 High
sfr   CCU6_T12PRL     =    	0x9c;  // RMAP=0, PAGE= 1 - CCU6 Timer T12 Period Register Low
sfr   CCU6_T12PRH     =   	0x9d;  // RMAP=0, PAGE= 1 - CCU6 Timer T12 Period Register High
sfr   CCU6_T13PRL     =    	0x9e;  // RMAP=0, PAGE= 1 - CCU6 Timer T13 Period Register Low
sfr   CCU6_T13PRH     =    	0x9f;  // RMAP=0, PAGE= 1 - CCU6 Timer T13 Period Register High
sfr   CCU6_T12DTCL    =    	0xa4;  // RMAP=0, PAGE= 1 - CCU6 Dead-Time Control Register for Timer T12 Low
sfr   CCU6_T12DTCH    =    	0xa5;  // RMAP=0, PAGE= 1 - CCU6 Dead-Time Control Register for Timer T12 High
sfr   CCU6_TCTR0L     =    	0xa6;  // RMAP=0, PAGE= 1 - CCU6 Timer Control Register 0 Low
sfr   CCU6_TCTR0H     =    	0xa7;  // RMAP=0, PAGE= 1 - CCU6 Timer Control Register 0 High
sfr   CCU6_CC60RL     =    	0xfa;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC60 Low
sfr   CCU6_CC60RH     =    	0xfb;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC60 High
sfr   CCU6_CC61RL     =    	0xfc;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC61 Low
sfr   CCU6_CC61RH     =    	0xfd;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC61 High
sfr   CCU6_CC62RL     =    	0xfe;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC62 Low
sfr   CCU6_CC62RH     =    	0xff;  // RMAP=0, PAGE= 1 - CCU6 Capture/Compare Register for Channel CC62 High
sfr   CCU6_T12MSELL   =    	0x9a;  // RMAP=0, PAGE= 2 - CCU6 T12 Capture/Compare Mode Select Register Low
sfr   CCU6_T12MSELH   =    	0x9b;  // RMAP=0, PAGE= 2 - CCU6 T12 Capture/Compare Mode Select Register High
sfr   CCU6_IENL       =    	0x9c;  // RMAP=0, PAGE= 2 - CCU6 Capture/Compare Interrupt Enable Register Low
sfr   CCU6_IENH       =    	0x9d;  // RMAP=0, PAGE= 2 - CCU6 Capture/Compare Interrupt Enable Register High
sfr   CCU6_INPL       =    	0x9e;  // RMAP=0, PAGE= 2 - CCU6 Capture/Compare Interrupt Node Pointer Register Low
sfr   CCU6_INPH       =    	0x9f;  // RMAP=0, PAGE= 2 - CCU6 Capture/Compare Interrupt Node Pointer Register High
sfr   CCU6_ISSL       =    	0xa4;  // RMAP=0, PAGE= 2 - CCU6 Capture/Compare Interrupt Status Set Register Low
sfr   CCU6_ISSH       =    	0xa5;  // RMAP=0, PAGE= 2 - CCU6 Capture/Compare Interrupt Status Set Register High
sfr   CCU6_PSLR       =    	0xa6;  // RMAP=0, PAGE= 2 - CCU6 Passive State Level Register
sfr   CCU6_MCMCTRL    =    	0xa7;  // RMAP=0, PAGE= 2 - CCU6 Multi-Channel Mode Control Register Low
sfr   CCU6_TCTR2L     =    	0xfa;  // RMAP=0, PAGE= 2 - CCU6 Timer Control Register 2 Low
sfr   CCU6_TCTR2H     =    	0xfb;  // RMAP=0, PAGE= 2 - CCU6 Timer Control Register 2 High
sfr   CCU6_MODCTRL    =    	0xfc;  // RMAP=0, PAGE= 2 - CCU6 Modulation Control Register Low
sfr   CCU6_MODCTRH    =    	0xfd;  // RMAP=0, PAGE= 2 - CCU6 Modulation Control Register High
sfr   CCU6_TRPCTRL    =    	0xfe;  // RMAP=0, PAGE= 2 - CCU6 Trap Control Register Low
sfr   CCU6_TRPCTRH    =    	0xff;  // RMAP=0, PAGE= 2 - CCU6 Trap Control Register High
sfr   CCU6_MCMOUTL    =    	0x9a;  // RMAP=0, PAGE= 3 - CCU6 Multi-Channel Mode Output Register Low
sfr   CCU6_MCMOUTH    =    	0x9b;  // RMAP=0, PAGE= 3 - CCU6 Multi-Channel Mode Output Register High
sfr   CCU6_ISL        =    	0x9c;  // RMAP=0, PAGE= 3 - CCU6 Capture/Compare Interrupt Status Register Low
sfr   CCU6_ISH        =    	0x9d;  // RMAP=0, PAGE= 3 - CCU6 Capture/Compare Interrupt Status Register High
sfr   CCU6_PISEL0L    =    	0x9e;  // RMAP=0, PAGE= 3 - CCU6 Port Input Select Register 0 Low
sfr   CCU6_PISEL0H    =    	0x9f;  // RMAP=0, PAGE= 3 - CCU6 Port Input Select Register 0 High
sfr   CCU6_PISEL2     =    	0xa4;  // RMAP=0, PAGE= 3 - CCU6 Port Input Select Register 2
sfr   CCU6_MCMCTRH    =    	0xa7;  // RMAP=0, PAGE= 3 - CCU6 Multi-Channel Mode Control Register High
sfr   CCU6_T12L       =    	0xfa;  // RMAP=0, PAGE= 3 - CCU6 Timer T12 Counter Register Low
sfr   CCU6_T12H       =    	0xfb;  // RMAP=0, PAGE= 3 - CCU6 Timer T12 Counter Register High
sfr   CCU6_T13L       =    	0xfc;  // RMAP=0, PAGE= 3 - CCU6 Timer T13 Counter Register Low
sfr   CCU6_T13H       =    	0xfd;  // RMAP=0, PAGE= 3 - CCU6 Timer T13 Counter Register High
sfr   CCU6_CMPSTATL   =    	0xfe;  // RMAP=0, PAGE= 3 - CCU6 Compare State Register Low
sfr   CCU6_CMPSTATH   =    	0xff;  // RMAP=0, PAGE= 3 - CCU6 Compare State Register High

/* CPU */
sfr   SP              =    	0x81;  // RMAP=x, PAGE= x - CPU Stack Pointer Register
sfr   DPL             =    	0x82;  // RMAP=x, PAGE= x - CPU Data Pointer Register Low
sfr   DPH             =    	0x83;  // RMAP=x, PAGE= x - CPU Data Pointer Register High
sfr   PCON            =    	0x87;  // RMAP=x, PAGE= x - CPU Power Control Register
sfr   TCON            =    	0x88;  // RMAP=x, PAGE= x - CPU Timer Control Register
sfr   TMOD            =    	0x89;  // RMAP=x, PAGE= x - CPU Timer Mode Register
sfr   TL0             =    	0x8a;  // RMAP=x, PAGE= x - CPU Timer 0 Register Low
sfr   TL1             =    	0x8b;  // RMAP=x, PAGE= x - CPU Timer 1 Register Low
sfr   TH0             =    	0x8c;  // RMAP=x, PAGE= x - CPU Timer 0 Register High
sfr   TH1             =    	0x8d;  // RMAP=x, PAGE= x - CPU Timer 1 Register High
sfr   MEX1            =    	0x94;  // RMAP=x, PAGE= x - CPU Memory Extension Register 1
sfr   MEX2            =    	0x95;  // RMAP=x, PAGE= x - CPU Memory Extension Register 2
sfr   MEX3            =    	0x96;  // RMAP=x, PAGE= x - CPU Memory Extension Register 3
sfr   MEXSP           =    	0x97;  // RMAP=x, PAGE= x - CPU Memory Extension Stack Pointer Register
sfr   SCON            =    	0x98;  // RMAP=x, PAGE= x - CPU Serial Channel Control Register
sfr   SBUF            =    	0x99;  // RMAP=x, PAGE= x - CPU Serial Data Buffer Register
sfr   EO              =    	0xa2;  // RMAP=x, PAGE= x - CPU Extended Operation Register
sfr   IEN0            =    	0xa8;  // RMAP=x, PAGE= x - CPU Interrupt Enable Register 0
sfr   IP              =    	0xb8;  // RMAP=x, PAGE= x - CPU Interrupt Priority Register
sfr   IPH             =    	0xb9;  // RMAP=x, PAGE= x - CPU Interrupt Priority High Register
sfr   PSW             =    	0xd0;  // RMAP=x, PAGE= x - CPU Program Status Word Register
sfr   ACC             =    	0xe0;  // RMAP=x, PAGE= x - CPU Accumulator Register
sfr   IEN1            =    	0xe8;  // RMAP=x, PAGE= x - CPU Interrupt Enable Register 1
sfr   B               =    	0xf0;  // RMAP=x, PAGE= x - CPU B Register
sfr   IP1             =    	0xf8;  // RMAP=x, PAGE= x - CPU Interrupt Priority 1 Register
sfr   IPH1            =    	0xf9;  // RMAP=x, PAGE= x - CPU Interrupt Priority 1 High Register
/* MDU */
sfr   MDU_MDUSTAT     =    	0xb0;  // RMAP=0, PAGE= x - MDU Status Register
sfr   MDU_MDUCON      =    	0xb1;  // RMAP=0, PAGE= x - MDU Control Register
sfr   MDU_MR0         =    	0xb2;  // RMAP=0, PAGE= x - MDU Result Register 0
sfr   MDU_MD0         =    	0xb2;  // RMAP=0, PAGE= x - MDU Operand Register 0
sfr   MDU_MR1         =    	0xb3;  // RMAP=0, PAGE= x - MDU Result Register 1
sfr   MDU_MD1         =    	0xb3;  // RMAP=0, PAGE= x - MDU Operand Register 1
sfr   MDU_MR2         =    	0xb4;  // RMAP=0, PAGE= x - MDU Result Register 2
sfr   MDU_MD2         =    	0xb4;  // RMAP=0, PAGE= x - MDU Operand Register 2
sfr   MDU_MD3         =    	0xb5;  // RMAP=0, PAGE= x - MDU Operand Register 3
sfr   MDU_MR3         =    	0xb5;  // RMAP=0, PAGE= x - MDU Result Register 3
sfr   MDU_MD4         =    	0xb6;  // RMAP=0, PAGE= x - MDU Operand Register 4
sfr   MDU_MR4         =    	0xb6;  // RMAP=0, PAGE= x - MDU Result Register 4
sfr   MDU_MR5         =    	0xb7;  // RMAP=0, PAGE= x - MDU Result Register 5
sfr   MDU_MD5         =    	0xb7;  // RMAP=0, PAGE= x - MDU Operand Register 5

