tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Infineon/TLE983x_SFR.H
/* NVM */
sfr   NVM_STATUS1     =    	0xe1;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_STATUS2     =    	0xe2;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_ADDRP       =    	0xe3;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_ADDRS       =    	0xe4;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_CTRL        =    	0xe5;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_MODE        =    	0xe6;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_MAP1        =    	0xe7;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_MAP2        =    	0xe9;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_BRNG        =    	0xea;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_PROT        =    	0xeb;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_SFRSEL      =    	0xec;  // RMAP=0, PAGE= x - NVM register
sfr   NVM_SFRDAT      =    	0xed;  // RMAP=0, PAGE= x - NVM register

/* OCDS */
sfr   MMCR2           =   	0xe9;  // RMAP=1, PAGE= x - OCDS Monitor Mode Control 2 Register
sfr   MEXTCR          =    	0xea;  // RMAP=1, PAGE= x - OCDS Memory Extension Control Register
sfr   MMWR1           =    	0xeb;  // RMAP=1, PAGE= x - OCDS Monitor Work Register 1
sfr   MMWR2           =    	0xec;  // RMAP=1, PAGE= x - OCDS Monitor Work Register 2
sfr   MMCR            =    	0xf1;  // RMAP=1, PAGE= x - OCDS Monitor Mode Control Register
sfr   MMSR            =    	0xf2;  // RMAP=1, PAGE= x - OCDS Monitor Mode Status Register
sfr   MMBPCR          =    	0xf3;  // RMAP=1, PAGE= x - OCDS Breakpoints Control Register
sfr   MMICR           =    	0xf4;  // RMAP=1, PAGE= x - OCDS Monitor Mode Interrupt Control Register
sfr   MMDR            =    	0xf5;  // RMAP=1, PAGE= x - OCDS Monitor Mode Data Register
sfr   HWBPSR          =    	0xf6;  // RMAP=1, PAGE= x - OCDS Hardware Breakpoints Select Register
sfr   HWBPDR          =    	0xf7;  // RMAP=1, PAGE= x - OCDS Hardware Breakpoints Data Register

/* Port */
sfr   PORT_PAGE       =    	0x8e;  // RMAP=0, PAGE= x - Port Page Register
sfr   P0_DATA         =    	0x80;  // RMAP=0, PAGE= 0 - Port P0 Data Register
sfr   P0_DIR          =    	0x86;  // RMAP=0, PAGE= 0 - Port P0 Direction Register
sfr   P1_DATA         =    	0x90;  // RMAP=0, PAGE= 0 - Port P1 Data Register
sfr   P1_DIR          =    	0x91;  // RMAP=0, PAGE= 0 - Port P1 Direction Register
sfr   P2_DATA         =    	0xc8;  // RMAP=0, PAGE= 0 - Port P2 Data Register
sfr   P2_DIR          =    	0xc9;  // RMAP=0, PAGE= 0 - Port P2 Direction Register
sfr   P0_PUDSEL       =    	0x80;  // RMAP=0, PAGE= 1 - Port P0 Pull-Up/Pull-Down Select Register
sfr   P0_PUDEN        =    	0x86;  // RMAP=0, PAGE= 1 - Port P0 Pull-Up/Pull-Down Enable Register
sfr   P1_PUDSEL       =    	0x90;  // RMAP=0, PAGE= 1 - Port P1 Pull-Up/Pull-Down Select Register
sfr   P1_PUDEN        =    	0x91;  // RMAP=0, PAGE= 1 - Port P1 Pull-Up/Pull-Down Enable Register
sfr   P2_PUDSEL       =    	0xc8;  // RMAP=0, PAGE= 1 - Port P2 Pull-Up/Pull-Down Select Register
sfr   P2_PUDEN        =    	0xc9;  // RMAP=0, PAGE= 1 - Port P2 Pull-Up/Pull-Down Enable Register
sfr   P0_ALTSEL0      =    	0x80;  // RMAP=0, PAGE= 2 - Port P0 Alternate Select 0 Register
sfr   P0_ALTSEL1      =    	0x86;  // RMAP=0, PAGE= 2 - Port P0 Alternate Select 1 Register
sfr   P1_ALTSEL0      =    	0x90;  // RMAP=0, PAGE= 2 - Port P1 Alternate Select 0 Register
sfr   P1_ALTSEL1      =    	0x91;  // RMAP=0, PAGE= 2 - Port P1 Alternate Select 1 Register
sfr   P0_OD           =    	0x80;  // RMAP=0, PAGE= 3 - Port P0 Open Drain Control Register
sfr   P1_OD           =    	0x90;  // RMAP=0, PAGE= 3 - Port P1 Open Drain Control Register

/* SCU */
sfr   SCU_PAGE        =    	0xf1;  // RMAP=0, PAGE= x - SCU Page Register
sfr   SYSCON0         =    	0x8f;  // RMAP=x, PAGE= x - SCU System Control Register 0
sfr   IRCON0          =    	0xf2;  // RMAP=0, PAGE= 0 - SCU Interrupt Request Register 0
sfr   IRCON1          =    	0xf3;  // RMAP=0, PAGE= 0 - SCU Interrupt Request Register 1
sfr   IRCON3          =    	0xf5;  // RMAP=0, PAGE= 0 - SCU Interrupt Request Register 3
sfr   IRCON4          =    	0xf6;  // RMAP=0, PAGE= 0 - SCU Interrupt Request Register 4
sfr   NMISR           =    	0xf7;  // RMAP=0, PAGE= 0 - SCU NMI Status Register
sfr   NMICON          =    	0xf2;  // RMAP=0, PAGE= 1 - SCU NMI Control Register
sfr   EXICON0         =    	0xf3;  // RMAP=0, PAGE= 1 - SCU External Interrupt Control Register 0
sfr   MODIEN          =    	0xf7;  // RMAP=0, PAGE= 1 - SCU Peripheral Interrupt Enable Register
sfr   PASSWD          =    	0xf2;  // RMAP=0, PAGE= 2 - SCU Password Register
sfr   PMCON0          =    	0xf3;  // RMAP=0, PAGE= 2 - SCU Power Mode Control Register 0
sfr   PLL_CON         =    	0xf4;  // RMAP=0, PAGE= 2 - SCU PLL Control Register
sfr   CMCON           =    	0xf5;  // RMAP=0, PAGE= 2 - SCU Clock Control Register
sfr   WDTCON          =    	0xf6;  // RMAP=0, PAGE= 2 - SCU Watchdog Timer Control Register
sfr   XADDRH          =    	0xf2;  // RMAP=0, PAGE= 3 - SCU On-chip XRAM Address Higher Order
sfr   PMCON1          =    	0xf3;  // RMAP=0, PAGE= 3 - SCU Power Mode Control Register 1
sfr   RSTCON          =    	0xf6;  // RMAP=0, PAGE= 3 - SCU Reset Control Register
sfr   WDTREL          =    	0xf3;  // RMAP=0, PAGE= 4 - SCU Watchdog Timer Reload Register
sfr   WDTWINB         =    	0xf4;  // RMAP=0, PAGE= 4 - SCU Watchdog Window-Boundary Count Register
sfr   WDTL            =    	0xf5;  // RMAP=0, PAGE= 4 - SCU Watchdog Timer Register Low
sfr   WDTH            =    	0xf6;  // RMAP=0, PAGE= 4 - SCU Watchdog Timer Register High
sfr   BCON            =    	0xf2;  // RMAP=0, PAGE= 5 - SCU Baud Rate Control Register
sfr   BG              =    	0xf3;  // RMAP=0, PAGE= 5 - SCU Baud Rate Timer/Reload Register
sfr   FDCON           =    	0xf4;  // RMAP=0, PAGE= 5 - SCU Fractional Divider Control Register
sfr   FDSTEP          =    	0xf5;  // RMAP=0, PAGE= 5 - SCU Fractional Divider Reload Register
sfr   FDRES           =    	0xf6;  // RMAP=0, PAGE= 5 - SCU Fractional Divider Result Register
sfr   ID              =    	0xf2;  // RMAP=0, PAGE= 6 - SCU Identity Register
sfr   OSC_CON         =    	0xf4;  // RMAP=0, PAGE= 6 - SCU OSC Control Register
sfr   COCON           =    	0xf5;  // RMAP=0, PAGE= 6 - SCU Clock Output Control Register
sfr   MODPISEL        =    	0xf2;  // RMAP=0, PAGE= 7 - SCU Peripheral Input Select Register
sfr   MODPISEL1       =    	0xf3;  // RMAP=0, PAGE= 7 - SCU Peripheral Input Select Register 1
sfr   MODPISEL2       =    	0xf4;  // RMAP=0, PAGE= 7 - SCU Peripheral Input Select Register 2
sfr   MODSUSP         =    	0xf6;  // RMAP=0, PAGE= 7 - SCU Module Suspend Control Register
sfr   EDCCON          =    	0xf2;  // RMAP=0, PAGE= 8 - SCU Error Detection and Correction Control Register
sfr   EDCSTAT         =    	0xf3;  // RMAP=0, PAGE= 8 - SCU Error Detection and Correction Status Register
sfr   MEMSTAT         =    	0xf7;  // RMAP=0, PAGE= 8 - SCU Memory Status Register
sfr   SPARE0          =    	0xf2;  // RMAP=0, PAGE= 9 - SCU Spare Register 0
sfr   SPARE1          =    	0xf3;  // RMAP=0, PAGE= 9 - SCU Spare Register 1
sfr   P0_POCON0       =    	0xf2;  // RMAP=0, PAGE=11 - SCU Port00 Output Control Register
sfr   P0_POCON1       =    	0xf3;  // RMAP=0, PAGE=11 - SCU Port01 Output Control Register
sfr   P0_POCON2       =    	0xf4;  // RMAP=0, PAGE=11 - SCU Port02 Output Control Register
sfr   TCCR            =    	0xf7;  // RMAP=0, PAGE=11 - SCU Temperature Compensation Control Register
sfr   P1_POCON0       =    	0xf2;  // RMAP=0, PAGE=12 - SCU Port10 Output Control Register
sfr   P1_POCON1       =    	0xf3;  // RMAP=0, PAGE=12 - SCU Port11 Output Control Register
sfr   P1_POCON2       =    	0xf4;  // RMAP=0, PAGE=12 - SCU Port12 Output Control Register
sfr   XRTESTL         =    	0xf2;  // RMAP=0, PAGE=13 - SCU XRAM Test Register, Low Byte
sfr   XRTESTH         =    	0xf3;  // RMAP=0, PAGE=13 - SCU XRAM Test Register, High Byte
sfr   IRTESTL         =    	0xf4;  // RMAP=0, PAGE=13 - SCU IRAM Test Register, Low Byte
sfr   IRTESTH         =    	0xf5;  // RMAP=0, PAGE=13 - SCU IRAM Test Register, High Byte
sfr   BRTEST          =    	0xf6;  // RMAP=0, PAGE=13 - SCU BROM Test Register
sfr   MEMTEST         =    	0xf7;  // RMAP=0, PAGE=13 - SCU Memory Test Register
sfr   TSCON0          =    	0xf2;  // RMAP=0, PAGE=14 - SCU Test Control Register 0
sfr   TSCON1          =    	0xf3;  // RMAP=0, PAGE=14 - SCU Test Control Register 1
sfr   TSCON2          =    	0xf4;  // RMAP=0, PAGE=14 - SCU Test Control Register 2
sfr   TSCON3          =    	0xf5;  // RMAP=0, PAGE=14 - SCU Test Control Register 3
sfr   VAR_IDL         =    	0xf2;  // RMAP=0, PAGE=15 - SCU Variant Identity Register Low
sfr   VAR_IDH         =    	0xf3;  // RMAP=0, PAGE=15 - SCU Variant Identity Register High
sfr   OSC_TRIM        =    	0xf4;  // RMAP=0, PAGE=15 - SCU OSC Trim Register
sfr   PKGCFG0         =    	0xf5;  // RMAP=0, PAGE=15 - SCU Package Configuration Register 0
sfr   PKGCFG1         =    	0xf6;  // RMAP=0, PAGE=15 - SCU Package Configuration Register 1
sfr   SSTCON          =    	0xf7;  // RMAP=0, PAGE=15 - SCU Firmware System Control Register

/* SSC */
sfr   SSC_PISEL       =    	0xa9;  // RMAP=0, PAGE= x - SSC Port Input Select Register
sfr   SSC_CONL        =    	0xaa;  // RMAP=0, PAGE= x - SSC Control Register Low Operating Mode
sfr   SSC_CONH        =    	0xab;  // RMAP=0, PAGE= x - SSC Control Register High Operating Mode
sfr   SSC_TBL         =    	0xac;  // RMAP=0, PAGE= x - SSC Transmitter Buffer Register Low
sfr   SSC_RBL         =    	0xad;  // RMAP=0, PAGE= x - SSC Receiver Buffer Register Low
sfr   SSC_BRL         =    	0xae;  // RMAP=0, PAGE= x - SSC Baud Rate Timer Reload Register Low
sfr   SSC_BRH         =    	0xaf;  // RMAP=0, PAGE= x - SSC Baud Rate Timer Reload Register High

/* T2 */
sfr   PERIPHERAL_PAGE =    	0xc7;  // RMAP=0, PAGE= x - T2 Page Register
sfr   T2_T2CON        =    	0xc0;  // RMAP=0, PAGE= 0 - T2 Timer 2 Control Register
sfr   T2_T2MOD        =    	0xc1;  // RMAP=0, PAGE= 0 - T2 Timer 2 Mode Register
sfr   T2_RC2L         =    	0xc2;  // RMAP=0, PAGE= 0 - T2 Timer 2 Reload/Capture Register Low
sfr   T2_RC2H         =    	0xc3;  // RMAP=0, PAGE= 0 - T2 Timer 2 Reload/Capture Register High
sfr   T2_T2L          =    	0xc4;  // RMAP=0, PAGE= 0 - T2 Timer 2 Register Low
sfr   T2_T2H          =    	0xc5;  // RMAP=0, PAGE= 0 - T2 Timer 2 Register High
sfr   T2_T2CON1       =    	0xc6;  // RMAP=0, PAGE= 0 - T2 Timer 2 Control Register 1

