tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Infineon/TLE983x_SFR.H
/* T21 */
sfr   T21_T2CON       =    	0xc0;  // RMAP=0, PAGE= 8 - T21 Timer 2 Control Register
sfr   T21_T2MOD       =    	0xc1;  // RMAP=0, PAGE= 8 - T21 Timer 2 Mode Register
sfr   T21_RC2L        =    	0xc2;  // RMAP=0, PAGE= 8 - T21 Timer 2 Reload/Capture Register Low
sfr   T21_RC2H        =    	0xc3;  // RMAP=0, PAGE= 8 - T21 Timer 2 Reload/Capture Register High
sfr   T21_T2L         =    	0xc4;  // RMAP=0, PAGE= 8 - T21 Timer 2 Register Low
sfr   T21_T2H         =    	0xc5;  // RMAP=0, PAGE= 8 - T21 Timer 2 Register High
sfr   T21_T2CON1      =    	0xc6;  // RMAP=0, PAGE= 8 - T21 Timer 21 Control Register 1


//   Definition of the PAGE SFR

//   PORT_PAGE
#define _pp0 PORT_PAGE=0 // PORT_PAGE postfix
#define _pp1 PORT_PAGE=1 // PORT_PAGE postfix
#define _pp2 PORT_PAGE=2 // PORT_PAGE postfix
#define _pp3 PORT_PAGE=3 // PORT_PAGE postfix

//   ADC_PAGE
#define _ad0 ADC_PAGE=0 // ADC_PAGE postfix
#define _ad1 ADC_PAGE=1 // ADC_PAGE postfix
#define _ad2 ADC_PAGE=2 // ADC_PAGE postfix
#define _ad3 ADC_PAGE=3 // ADC_PAGE postfix
#define _ad4 ADC_PAGE=4 // ADC_PAGE postfix
#define _ad5 ADC_PAGE=5 // ADC_PAGE postfix
#define _ad6 ADC_PAGE=6 // ADC_PAGE postfix

//   SCU_PAGE
#define _su0 SCU_PAGE=0 // SCU_PAGE postfix
#define _su1 SCU_PAGE=1 // SCU_PAGE postfix
#define _su2 SCU_PAGE=2 // SCU_PAGE postfix
#define _su3 SCU_PAGE=3 // SCU_PAGE postfix
#define _su3 SCU_PAGE=3 // SCU_PAGE postfix
#define _su4 SCU_PAGE=4 // SCU_PAGE postfix
#define _su5 SCU_PAGE=5 // SCU_PAGE postfix
#define _su6 SCU_PAGE=6 // SCU_PAGE postfix
#define _su7 SCU_PAGE=7 // SCU_PAGE postfix
#define _su8 SCU_PAGE=8 // SCU_PAGE postfix
#define _su9 SCU_PAGE=9 // SCU_PAGE postfix
#define _su10 SCU_PAGE=10 // SCU_PAGE postfix
#define _su11 SCU_PAGE=11 // SCU_PAGE postfix
#define _su12 SCU_PAGE=12 // SCU_PAGE postfix
#define _su13 SCU_PAGE=13 // SCU_PAGE postfix
#define _su14 SCU_PAGE=14 // SCU_PAGE postfix
#define _su15 SCU_PAGE=15 // SCU_PAGE postfix

//   CCU6_PAGE
#define _cc0 CCU6_PAGE=0 // CCU6_PAGE postfix
#define _cc1 CCU6_PAGE=1 // CCU6_PAGE postfix
#define _cc2 CCU6_PAGE=2 // CCU6_PAGE postfix
#define _cc3 CCU6_PAGE=3 // CCU6_PAGE postfix

//   T2_PAGE
#define _t21 PERIPHERAL_PAGE=8 // T21_PAGE postfix

#define SST0  0x80        // Save SFR page to ST0
#define RST0  0xC0        // Restore SFR page from ST0
#define SST1  0x90        // Save SFR page to ST1
#define RST1  0xD0        // Restore SFR page from ST1
#define SST2  0xA0        // Save SFR page to ST2
#define RST2  0xE0        // Restore SFR page from ST2
#define SST3  0xB0        // Save SFR page to ST3
#define RST3  0xF0        // Restore SFR page from ST3
#define noSST 0x00        // Switch page without saving

#define SFR_PAGE(pg,op) pg+op

//   SYSCON0_RMAP
//   The access to the mapped SFR area is enabled.
#define SET_RMAP() SYSCON0 |= 0x01

//   The access to the standard SFR area is enabled.
#define RESET_RMAP() SYSCON0 &= ~0x01


#define _su  SCU_PAGE // SCU_PAGE

